WS-VerificacionJugadores/documentacion/mensaje_axis_invocacion.xml

<?xml version="1.0" ?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
	<S:Header>
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			S:mustUnderstand="1">
			<wsse:BinarySecurityToken
				xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
				xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
				EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary"
				ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"
				wsu:Id="XWSSGID-1362486090175-465974905">MIICtDCCAh0CCQCZB/OIdOHO9TANBgkqhkiG9w0BAQUFADCBnzELMAkGA1UEBhMCZXMxDzANBgNV
				BAgMBm1hZHJpZDEPMA0GA1UEBwwGbWFkcmlkMQ8wDQYDVQQKDAZDQURHT0oxFjAUBgNVBAsMDUNB
				SU5GT1JNQVRJQ0ExFzAVBgNVBAMMDmNuanVlZ28uZ29iLmVzMSwwKgYJKoZIhvcNAQkBFh1kZ29q
				LnNvcG9ydGVvcGVyYWRvcmVzQG1laC5lczAeFw0xMTExMTYxMjMwMDNaFw0yMTA5MjQxMjMwMDNa
				MIGcMQswCQYDVQQGEwJlczEPMA0GA1UECAwGbWFkcmlkMQ8wDQYDVQQHDAZtYWRyaWQxETAPBgNV
				BAoMCG9wZXJhZG9yMREwDwYDVQQLDAhvcGVyYWRvcjEXMBUGA1UEAwwOY25qdWVnby5nb2IuZXMx
				LDAqBgkqhkiG9w0BCQEWHWRnb2ouc29wb3J0ZW9wZXJhZG9yZXNAbWVoLmVzMIGfMA0GCSqGSIb3
				DQEBAQUAA4GNADCBiQKBgQCr+jsE8atjTGBm9UCHPNMN8trU1cxkkvvHQxP+nVHAL2BCJSyb2CYY
				qFzqmoO0lhByr8Yw2nf5NWyjl1LPqxz871VyfB8kTi6uR9jCtL6NhUDR8fCmxV0CfY10ajlcIHjS
				kziVGO6MvXeaEGz3/0O1TiRr+SKm4Y9m+qqaun287QIDAQABMA0GCSqGSIb3DQEBBQUAA4GBAIXH
				1VHRRYaOe975xV1F3tTRiW3e5i7njhDBeFGpQtMFg1LRl78+E0IY5CgMHOVgny3qHEyOU0hkv/Nu
				+OTFpb49NrZCDDGMyhX2wP/UmTVGtmv68W4CxGf0HPbRudjRynC/oyQi9WmI0vw/Kg4Nghx7PZT4
				1Hi97tZweSEEcI1L
			</wsse:BinarySecurityToken>
			<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
				<ds:SignedInfo>
					<ds:CanonicalizationMethod
						Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
						<InclusiveNamespaces xmlns="http://www.w3.org/2001/10/xml-exc-c14n#"
							PrefixList="wsse S"></InclusiveNamespaces>
					</ds:CanonicalizationMethod>
					<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></ds:SignatureMethod>
					<ds:Reference URI="#XWSSGID-13624860903781404022428">
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod>
						<ds:DigestValue>ksReREBYk2uStWf1HGt4/vMdGjE=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#XWSSGID-13624860903785222258">
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod>
						<ds:DigestValue>uzAXj6hBDgJryGhk71++ysmN4mk=</ds:DigestValue>
					</ds:Reference>
				</ds:SignedInfo>
				<ds:SignatureValue>KHepzrLWtCpcwczO+01YnhYj4iv8SVEk2b5NZ6V5svRaNRdAksu5HuxqVCj/PkdmVE6C9Pncb6gM
					Ug/H+MMEwZI6CupUHMZ+18+8ru41QCE1BqITbFaWEm9giWiqA8NfRdz1VlAEZBPRjF8ccb1pBbR5
					JCaGUHNr2eBS6zFTVDI=
				</ds:SignatureValue>
				<ds:KeyInfo>
					<wsse:SecurityTokenReference
						xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
						wsu:Id="XWSSGID-1362486090347-2088370332">
						<wsse:Reference
							xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
							URI="#XWSSGID-1362486090175-465974905"
							ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"></wsse:Reference>
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
			</ds:Signature>
			<wsu:Timestamp
				xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
				wsu:Id="XWSSGID-13624860903785222258">
				<wsu:Created>2013-03-05T12:21:30Z</wsu:Created>
				<wsu:Expires>2013-03-05T12:21:35Z</wsu:Expires>
			</wsu:Timestamp>
		</wsse:Security>
	</S:Header>
	<S:Body
		xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
		wsu:Id="XWSSGID-13624860903781404022428">
		<ns2:verificarJugador
			xmlns:ns2="http://ws.cnjuego.gob.es/VerificacionJugadores/">
			<jugadores xmlns="">
				<dni>99999028L</dni>
				<nombre>FICTITIOUS</nombre>
				<apellido1>SPECIMEN</apellido1>
				<apellido2>SPECIMEN</apellido2>
				<fechaNacimiento>2005-10-19</fechaNacimiento>
			</jugadores>
		</ns2:verificarJugador>
	</S:Body>
</S:Envelope>